app/controllers/posts_controller.rb

  def update
    if @post.update_attributes(post_params)
---
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "asf j"], ["body", "<p>Hey</p>\r\n"], ["updated_at", "2017-07-31 21:59:59.360470"], ["id", 1]]